src/apersci/output/templates/request-refreshInventory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://v4.core.coexprivate.api.shopatron.com">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:RefreshRequest>
          <v4:FulfillerID>{{.FulfillerID}}</v4:FulfillerID>
          <v4:LocationName>{{.LocationName}}</v4:LocationName>
          <v4:Items>
            <!--Zero or more repetitions:-->
            {{range pipeline}}
            <v4:items>
                <v4:PartNumber>{{.PartNumber}}</v4:PartNumber>
                <v4:UPC>{{.UPC}}</v4:UPC>
                <v4:BinID>{{.BinID}</v4:BinID>
                <v4:Quantity>{{.Quantity}}</v4:Quantity>
                <v4:LTD>{{.LTD}}</v4:LTD>
                <v4:SafetyStock>{{.SafetyStock}}</v4:SafetyStock>
            </v4:items>
            {{end}}
          </v4:Items>
      </v4:RefreshRequest>
   </soapenv:Body>
</soapenv:Envelope>
